src/test/resources/xml/bufferpolygon-invalid-soaprequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- My data reference is invalid -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header />
	<soapenv:Body>
		<ps:BufferPolygonProcessRequest
			xmlns:ps="http://www.uncertweb.org/ProcessingService">
			<ps:Polygon>
				<ps:DataReference href="http://localhost:8000/xml/polygon-invalid.xml" />
			</ps:Polygon>
			<ps:Distance>2.5</ps:Distance>
		</ps:BufferPolygonProcessRequest>
	</soapenv:Body>
</soapenv:Envelope>
